Tekla.Structures.Model.BoltHoleAttributes
The bolt hole attributes.

Tekla.Structures.Model.BoltHoleAttributes.HoleType
The special hole type: oversized, tapped, slotted, blind or no hole.

Tekla.Structures.Model.BoltHoleAttributes.LongHoleX
The long hole X value.

Tekla.Structures.Model.BoltHoleAttributes.LongHoleY
The long hole Y value.

Tekla.Structures.Model.BoltHoleAttributes.SlotOffsetX
The slot offset X value that must be between +-0.5 x LongHoleX.

Tekla.Structures.Model.BoltHoleAttributes.SlotOffsetY
The slot offset Y value that must be between +-0.5 x LongHoleY.

Tekla.Structures.Model.BoltHoleAttributes.#ctor
Creates a new bolt hole attributes instance.

Tekla.Structures.Model.BoltHoleAttributes.#ctor(Tekla.Structures.Model.BoltHoleAttributes)
Creates a new bolt hole attributes instance by copying from an existing.
attributes: The bolt hole attributes to copy from.

Tekla.Structures.Model.BoltHoleAttributes.AreSlottedHoleOffsetsWellDefined
Examines whether the slotted bolt hole offset parameters are well defined.

Tekla.Structures.Model.BoltHoleAttributes.ToStruct(Tekla.Structures.ModelInternal.dotBoltHoleAttributes_t@)
Sets the bolt hole attributes from the struct to the current ones.
boltHoleAttributes: The bolt hole attributes.

Tekla.Structures.Model.BoltHoleAttributes.FromStruct(Tekla.Structures.ModelInternal.dotBoltHoleAttributes_t@)
Sets the current bolt hole attributes from the given struct parameter.
boltHoleAttributes: The bolt hole attributes.